---
kind: enumMember
id: F:Autodesk.Revit.DB.FailureSeverity.Error
enum: Autodesk.Revit.DB.FailureSeverity
zh: 错误、报错
source: html/d0cdffe3-22c5-b764-8090-5104f044b000.htm
---
# Autodesk.Revit.DB.FailureSeverity.Error

**中文**: 错误、报错

Failure that cannot be ignored.
 If FailureMeassage of this severity is posted, the current transaction cannot be committed unless
 failure is resolved via appropriate FailureResolution.